[Killed] BlockStatement
src/index.ts:1:51
-export const factorial = (num: number): number => {
-    if(num < 0) {
-        const errorMessage = "Factorial of negative numbers can not exist.";
-        console.error(errorMessage);
-        throw new Error(errorMessage);
-    }
-    // Stryker disable next-line EqualityOperator
-    else if(num <= 1) {
-        return 1;
-    } 
-    else {
-        return num * factorial(num - 1);
-    }
-}
+export const factorial = (num: number): number => {}
 
 // const testNum = 5;
killedBy: factorial() should calculate the factorial of a number greater than 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: undefined

[Killed] ConditionalExpression
src/index.ts:2:8
 export const factorial = (num: number): number => {
-    if(num < 0) {
+    if(true) {
         const errorMessage = "Factorial of negative numbers can not exist.";
         console.error(errorMessage);
killedBy: factorial() should calculate the factorial of a number greater than 1
statusReason: Error: Factorial of negative numbers can not exist.

[Killed] ConditionalExpression
src/index.ts:2:8
 export const factorial = (num: number): number => {
-    if(num < 0) {
+    if(false) {
         const errorMessage = "Factorial of negative numbers can not exist.";
         console.error(errorMessage);
killedBy: factorial() should return a error with a negative number
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Factorial of negative numbers can not exist."

Received function did not throw

[Killed] StringLiteral
src/index.ts:3:30
 export const factorial = (num: number): number => {
     if(num < 0) {
-        const errorMessage = "Factorial of negative numbers can not exist.";
+        const errorMessage = "";
         console.error(errorMessage);
         throw new Error(errorMessage);
killedBy: factorial() should return a error with a negative number
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Factorial of negative numbers can not exist."
Received message:   ""

      58 |         const errorMessage = stryMutAct_9fa48("6") ? "" : (stryCov_9fa48("6"), "Factorial of negative numbers can not exist.");
      59 |         console.error(errorMessage);
    > 60 |         throw new Error(errorMessage);

[Killed] EqualityOperator
src/index.ts:8:13
         throw new Error(errorMessage);
     }
     // Stryker disable next-line EqualityOperator
-    else if(num <= 1) {
+    else if(num > 1) {
         return 1;
     } 
killedBy: factorial() should calculate the factorial of a number greater than 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 1

[Killed] BlockStatement
src/index.ts:8:23
         throw new Error(errorMessage);
     }
     // Stryker disable next-line EqualityOperator
-    else if(num <= 1) {
-        return 1;
-    } 
+    else if(num <= 1) {} 
     else {
         return num * factorial(num - 1);
killedBy: factorial() should calculate the factorial of a number greater than 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: NaN

[Killed] BlockStatement
src/index.ts:11:10
     else if(num <= 1) {
         return 1;
     } 
-    else {
-        return num * factorial(num - 1);
-    }
+    else {}
 }
 
killedBy: factorial() should calculate the factorial of a number greater than 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: undefined

[Killed] ArithmeticOperator
src/index.ts:12:16
         return 1;
     } 
     else {
-        return num * factorial(num - 1);
+        return num / factorial(num - 1);
     }
 }
killedBy: factorial() should calculate the factorial of a number greater than 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 1.875

[Timeout] ArithmeticOperator
src/index.ts:12:32
         return 1;
     } 
     else {
-        return num * factorial(num - 1);
+        return num * factorial(num + 1);
     }
 }
