[Killed] BlockStatement
src/index.ts:1:61
-export const mean = (num1: number, num2: number): number => {
-    return (num1 + num2) / 2
-}
+export const mean = (num1: number, num2: number): number => {}
 
 // const testNum1 = 4;
killedBy: mean() should calculate the mean of 4 and 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
src/index.ts:2:12
 export const mean = (num1: number, num2: number): number => {
-    return (num1 + num2) / 2
+    return (num1 + num2) * 2
 }
 
killedBy: mean() should calculate the mean of 4 and 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 8

[Killed] ArithmeticOperator
src/index.ts:2:13
 export const mean = (num1: number, num2: number): number => {
-    return (num1 + num2) / 2
+    return (num1 - num2) / 2
 }
 
killedBy: mean() should calculate the mean of 2 and 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -1
